import random
import numpy as np
############################

# количество чтрок генирируимих gpt
sravneniaStrok = 10



# первое значения количество строк припева, вторая килисество строк в куплети ,количество повторений
levelPesni = [[4, 4, 2], [4, 4, 3], [5, 4, 3], [4, 4, 4], [5, 4, 4], [10, 10, 10]]


q = 0



golosni = ['а','о','у','е','ё','э','и','ы','ю','я']

# даний для синтезатора речи
freimS = 24000

clog = [["а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и", "й", "к", "л", "м", "н", "о",
        "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я",
         " ", ".", ",", ":", ";", "-", "—", "!", "?", "(", ")"],   #  ":", ";", "-", "—" ,"(", ")"
        ["вы", "ци", "за", "по", "ши", "ды", "жё", "ны", "бю", "то",
        "щи", "бы", "сь", "чё", "шу", "чу", "ть", "дя", "па", "се",
        "не", "чо", "до", "вя", "на", "ри", "пе", "го", "лы", "жи",
        "со", "те", "фи", "ля", "ще", "ро", "ма", "ку", "ло", "ву",
        "но", "ко", "ди", "та", "си", "ве", "гу", "су", "шь", "ва",
        "ся", "ша", "дь", "мю", "мо", "ху", "зу", "бе", "пк", "де",
        "ки", "ги", "ща", "ца", "чи", "че", "лю", "би", "ре", "ме",
        "ст", "ни", "са", "ше", "па", "ми", "ле", "хо", "га", "ве",
        "ха", "пи", "ра", "ча", "бо", "му", "ти", "во", "ба", "бе",
        "сы", "мы", "тя", "па", "бя", "ли", "пу", "ня", "лё", "зо",
        "вё", "ле", "ры", "да", "мо", "ра", "ви", "ду", "хе", "ге",
        "же", "фе", "ря", "зи", "жа", "лу", "шь", "бу", "ту", "ну",
        "зе", "зы", "шё", "ла", "мя", "жу", "дё", "фа", "ру", "ты",
        "це", "ка", "рё", "нь", "щё", "ль", "йн"],
        ["дно", "тру", "смо", "тре", "рнё", "ска", "где", "спо", "вля", "пли",
        "зго", "сла", "жда", "вто", "ско", "дна", "йна", "смы", "нте", "рне",
        "кре", "рты", "зве", "гля", "крё", "мся", "кла", "ссе", "тро", "нта",
        "нфи", "йти", "вры", "вле", "тря", "йди", "бла", "дны", "дхо", "нна",
        "нны", "гно", "дбе", "лся", "лки", "рта", "влю", "бля", "пры", "вли",
        "хло", "схо", "жду", "хну", "зню", "тку", "рво", "рши", "зть", "кра",
        "зна", "рто", "кто", "шно", "бма", "нчи", "йте", "бли", "чно", "чне",
        "чны", "спи", "ске", "шку", "бре", "шни", "тща", "пре", "дло", "лну",
        "зво", "лты", "мне", "сха", "две", "кст", "йдё", "сме", "рть", "рны",
        "лже", "нца", "йду", "йма", "сше", "жчи", "дше", "хва", "шки", "рку",
        "бну", "мна", "сбе", "сна", "лче", "клю", "три", "нча", "зжа", "йше",
        "рни", "лго", "два", "рми", "бро", "при", "кро", "жно", "вны", "рше",
        "мла", "спу", "ску", "зли", "шли", "сть", "лко", "пло", "здо", "рте",
        "зби", "бка", "лше", "дни", "тса", "ждй", "мни", "блю", "дня", "лне",
        "дну", "вче", "спе", "вко", "йно", "сну", "ймё", "гре", "зре", "ржа",
        "дпи", "сне", "нфо", "для", "бще", "нно", "сса", "лчу", "вме", "тво",
        "хто", "зде", "тве", "влё", "ппы", "спа", "стю", "бке", "бки", "мню",
        "чре", "сшу", "тня", "взя", "вку", "гро", "нри", "про", "сто", "рня",
        "тно", "нты", "ргу", "кру", "нни", "сму", "тся", "зно", "что", "сво",
        "гда", "нти", "зни", "рсо", "зда", "ста", "рвы", "ршо", "шко", "жны",
        "сре", "дне", "тра", "вмы", "мпа", "сте", "сни", "кте", "сту", "шла",
        "дру", "стя", "чка", "лка", "сли", "йся", "гра", "сце", "вка", "шлы",
        "нто", "нги", "сло", "вно", "гры", "клу", "змо", "бра", "слу", "всё",
        "шка", "сты", "хво", "рма", "нка", "гру", "кти", "вне", "сле", "пла",
        "чки", "чле", "ски", "тпа", "пна", "мба", "дво", "чни", "гла", "пря",
        "сти", "все", "всо", "счи", "хта"],
        ["льни", "стра", "льно", "ться", "нька", "взды", "льне", "лсты", "вздо", "ссны",
        "взры", "сска", "дьми", "льну", "мпью", "зьму", "стру", "звле", "стры", "спро",
        "лзно", "скро", "вспо", "ссла", "ньги", "льше", "ссле", "кста", "кспе", "твле",
        "льзу", "льна", "льшо", "всту", "льчи", "нько", "збло", "вклю", "йста", "лько",
        "схва", "лжны", "лкну", "льны", "вста", "вска", "стро", "мства", "тству", "йство",
        "тстви", "тства", "встве", "льке"]]

clogTaim = [[0.211, 0.317, 0.142, 0.325, 0.318, 0.349, 0.399, 0.352, 0.372, 0.229,
        0.209, 0.134, 0.301, 0.287, 0.303, 0.238, 0.235, 0.242, 0.277, 0.093, 0.214,
        0.245, 0.179, 0.302, 0.314, 0.338, 0.352, 0.160, 0.204, 0.173, 0.185, 0.341, 0.3,
        0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2],
        [0.332, 0.257, 0.345, 0.265, 0.338, 0.283, 0.388, 0.291, 0.329, 0.226,
        0.340, 0.278, 0.194, 0.308, 0.327, 0.273, 0.137, 0.307, 0.226, 0.332,
        0.292, 0.276, 0.314, 0.345, 0.278, 0.255, 0.222, 0.323, 0.291, 0.321,
        0.250, 0.255, 0.294, 0.318, 0.381, 0.290, 0.288, 0.212, 0.298, 0.284,
        0.289, 0.258, 0.299, 0.239, 0.346, 0.300, 0.257, 0.334, 0.248, 0.314,
        0.310, 0.318, 0.154, 0.275, 0.354, 0.281, 0.296, 0.305, 0.378, 0.307,
        0.223, 0.292, 0.368, 0.311, 0.307, 0.304, 0.287, 0.255, 0.280, 0.306,
        0.218, 0.276, 0.337, 0.345, 0.191, 0.238, 0.289, 0.308, 0.285, 0.345,
        0.272, 0.196, 0.325, 0.278, 0.307, 0.273, 0.231, 0.358, 0.292, 0.304,
        0.341, 0.254, 0.254, 0.203, 0.300, 0.279, 0.203, 0.306, 0.315, 0.369,
        0.343, 0.302, 0.305, 0.291, 0.323, 0.318, 0.291, 0.299, 0.382, 0.250,
        0.388, 0.345, 0.313, 0.304, 0.348, 0.274, 0.221, 0.278, 0.210, 0.245,
        0.347, 0.322, 0.348, 0.304, 0.300, 0.345, 0.339, 0.294, 0.270, 0.241,
        0.306, 0.244, 0.318, 0.215, 0.391, 0.300, 0.848],
        [0.373, 0.262, 0.416, 0.286, 0.386, 0.291, 0.427, 0.286, 0.346, 0.278,
        0.412, 0.375, 0.397, 0.411, 0.329, 0.377, 0.351, 0.400, 0.466, 0.397,
        0.289, 0.319, 0.432, 0.395, 0.315, 0.429, 0.298, 0.411, 0.316, 0.373,
        0.411, 0.356, 0.345, 0.391, 0.267, 0.342, 0.390, 0.363, 0.332, 0.354,
        0.340, 0.375, 0.394, 0.441, 0.382, 0.349, 0.359, 0.375, 0.261, 0.324,
        0.407, 0.402, 0.361, 0.335, 0.423, 0.253, 0.399, 0.384, 0.221, 0.319,
        0.368, 0.379, 0.259, 0.379, 0.376, 0.431, 0.349, 0.324, 0.360, 0.408,
        0.354, 0.301, 0.334, 0.331, 0.335, 0.392, 0.358, 0.257, 0.425, 0.371,
        0.312, 0.373, 0.365, 0.368, 0.401, 0.220, 0.370, 0.423, 0.267, 0.367,
        0.430, 0.463, 0.392, 0.388, 0.376, 0.380, 0.348, 0.331, 0.318, 0.328,
        0.335, 0.381, 0.401, 0.412, 0.447, 0.292, 0.246, 0.474, 0.410, 0.438,
        0.373, 0.444, 0.356, 0.345, 0.366, 0.244, 0.309, 0.398, 0.359, 0.446,
        0.370, 0.349, 0.288, 0.338, 0.354, 0.209, 0.399, 0.279, 0.395, 0.405,
        0.400, 0.263, 0.468, 0.334, 0.318, 0.372, 0.351, 0.319, 0.415, 0.429,
        0.368, 0.366, 0.298, 0.296, 0.370, 0.362, 0.434, 0.393, 0.410, 0.406,
        0.297, 0.443, 0.447, 0.361, 0.375, 0.406, 0.402, 0.388, 0.406, 0.331,
        0.301, 0.402, 0.309, 0.359, 0.230, 0.277, 0.329, 0.317, 0.323, 0.340,
        0.358, 0.315, 0.354, 0.398, 0.242, 0.374, 0.327, 0.301, 0.341, 0.434,
        0.355, 0.375, 0.379, 0.279, 0.308, 0.361, 0.341, 0.377, 0.314, 0.394,
        0.381, 0.425, 0.388, 0.439, 0.275, 0.333, 0.379, 0.399, 0.316, 0.375,
        0.393, 0.400, 0.281, 0.392, 0.358, 0.367, 0.393, 0.303, 0.293, 0.402,
        0.331, 0.337, 0.317, 0.356, 0.373, 0.406, 0.384, 0.406, 0.282, 0.360,
        0.395, 0.409, 0.411, 0.346, 0.324, 0.285, 0.397, 0.344, 0.357, 0.359,
        0.314, 0.307, 0.360, 0.370, 0.407, 0.392, 0.260, 0.407, 0.408, 0.295,
        0.313, 0.368, 0.318, 0.296, 0.341, 0.404, 0.442, 0.358, 0.393, 0.268,
        0.325, 0.380, 0.351, 1.009, 0.968],
        [0.412, 0.365, 0.470, 0.414, 0.422, 0.422, 0.455, 0.400, 0.466, 0.402,
        0.429, 0.368, 0.408, 0.410, 0.407, 0.434, 0.367, 0.411, 0.373, 0.363,
        0.448, 0.423, 0.365, 0.427, 0.396, 0.443, 0.468, 0.324, 0.329, 0.372,
        0.384, 0.445, 0.428, 0.340, 0.428, 0.426, 0.444, 0.344, 0.314, 0.407,
        0.420, 0.449, 0.398, 0.426, 0.341, 0.330, 0.393, 0.472, 0.411, 0.502,
        0.387, 0.387, 0.434, 0.434, 1.009]]


sislomas = [
        ["ноль", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"],
        ["десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"],
        ["десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "семьдесят", "девяносто"],
        ["сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"]
]
sisloLeval = ["тысяча", "миллион", "миллиард", "триллион", "квадрилион", "сексистилион", "септилион", "окталион", "dddd"]
sisloLeval2 = ["десятих", "сотих", "тысячачних","десять тысячачних","сто тысячачних", "миллионих","десять миллионих",
              "сто миллионих", "миллиардних","десять миллиардних","сто миллиардних", "десять триллионих","сто триллионих",
              "триллионих","десять триллионих","сто триллионих", "квадрилионих","десять квадрилионих","сто квадрилионих",
              "сексистилооних", "десять сексистилооних", "сто сексистилооних", "септилионих"]









